https://pypi.org/project/summarytools/

https://pypi.org/project/skimpy/

In [1]:
import pandas as pd
import numpy as np

C:\Users\ACER\anaconda31\lib\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [2]:
data = {

    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],

    'Age': [25, 30, 22, 35, 28],

    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Miami'],

    'Salary': [60000, 80000, 55000, 75000, 70000]

}

 

data

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
 'Age': [25, 30, 22, 35, 28],
 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Miami'],
 'Salary': [60000, 80000, 55000, 75000, 70000]}

In [3]:
df = pd.DataFrame(data)
df

      Name  Age           City  Salary
0    Alice   25       New York   60000
1      Bob   30  San Francisco   80000
2  Charlie   22    Los Angeles   55000
3    David   35        Chicago   75000
4      Eva   28          Miami   70000

In [4]:
#Select Name column in Series
type(df['Name'])

pandas.core.series.Series

In [5]:
# Select Name column in dataframe form
type(df[['Name']])

pandas.core.frame.DataFrame

In [6]:
# Select Multiple columns
df[['Name','Age', 'Salary']]

      Name  Age  Salary
0    Alice   25   60000
1      Bob   30   80000
2  Charlie   22   55000
3    David   35   75000
4      Eva   28   70000

In [7]:
# Filtering the data with name 'Alice'

#df[['Name']] == 'Alice'
df[df['Name'] == 'Alice']

    Name  Age      City  Salary
0  Alice   25  New York   60000

In [8]:
# If we reqire only name
df[df['Name'] == 'Alice'][['Name']]

    Name
0  Alice

In [9]:
df[['Name']][df['Name']=='Alice']

    Name
0  Alice

In [10]:
df.query('Name == "Alice"')

    Name  Age      City  Salary
0  Alice   25  New York   60000

In [11]:
df.query('Salary > 70000')

    Name  Age           City  Salary
1    Bob   30  San Francisco   80000
3  David   35        Chicago   75000

In [12]:
df.query('Age > 25')

    Name  Age           City  Salary
1    Bob   30  San Francisco   80000
3  David   35        Chicago   75000
4    Eva   28          Miami   70000

In [13]:
df[df['Age']>25]

    Name  Age           City  Salary
1    Bob   30  San Francisco   80000
3  David   35        Chicago   75000
4    Eva   28          Miami   70000

In [14]:
# Multiple columns
df.query('Age > 25 & Salary > 75000')

  Name  Age           City  Salary
1  Bob   30  San Francisco   80000

In [15]:
df[(df['Age'] > 25) & (df['Salary'] > 75000)]

  Name  Age           City  Salary
1  Bob   30  San Francisco   80000

In [16]:
df

      Name  Age           City  Salary
0    Alice   25       New York   60000
1      Bob   30  San Francisco   80000
2  Charlie   22    Los Angeles   55000
3    David   35        Chicago   75000
4      Eva   28          Miami   70000

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
 3   Salary  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 288.0+ bytes

In [18]:
df.describe

<bound method NDFrame.describe of       Name  Age           City  Salary
0    Alice   25       New York   60000
1      Bob   30  San Francisco   80000
2  Charlie   22    Los Angeles   55000
3    David   35        Chicago   75000
4      Eva   28          Miami   70000>

In [19]:
df.shape

(5, 4)

In [20]:
df.columns

Index(['Name', 'Age', 'City', 'Salary'], dtype='object')

In [21]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [22]:
df.size

20

In [23]:
df.memory_usage()

Index     128
Name       40
Age        40
City       40
Salary     40
dtype: int64

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
pip install skimpy

Collecting skimpy
  Using cached skimpy-0.0.14-py3-none-any.whl (16 kB)
Requirement already satisfied: click<9.0.0,>=8.1.6 in c:\users\acer\anaconda31\lib\site-packages (from skimpy) (8.1.7)
Requirement already satisfied: pyarrow<16,>=13 in c:\users\acer\anaconda31\lib\site-packages (from skimpy) (15.0.2)
Requirement already satisfied: rich<14.0,>=10.9 in c:\users\acer\anaconda31\lib\site-packages (from skimpy) (12.6.0)
Requirement already satisfied: numpy<2.0.0,>=1.22.2 in c:\users\acer\anaconda31\lib\site-packages (from skimpy) (1.23.5)
Requirement already satisfied: Pygments<3.0.0,>=2.10.0 in c:\users\acer\anaconda31\lib\site-packages (from skimpy) (2.11.2)
Requirement already satisfied: ipykernel<7.0.0,>=6.7.0 in c:\users\acer\anaconda31\lib\site-packages (from skimpy) (6.19.2)
Collecting quartodoc<0.8.0,>=0.7.2
  Using cached quartodoc-0.7.2-py3-none-any.whl (77 kB)
Requirement already satisfied: polars<0.21,>=0.19 in c:\users\acer\anaconda31\lib\site-packages (from skimpy) (0.20.16)
Requirement already satisfied: typeguard==4.1.5 in c:\users\acer\anaconda31\lib\site-packages (from skimpy) (4.1.5)
Requirement already satisfied: pandas<3.0.0,>=2.0.3 in c:\users\acer\anaconda31\lib\site-packages (from skimpy) (2.2.1)
Requirement already satisfied: typing-extensions>=4.7.0 in c:\users\acer\anaconda31\lib\site-packages (from typeguard==4.1.5->skimpy) (4.10.0)
Requirement already satisfied: colorama in c:\users\acer\anaconda31\lib\site-packages (from click<9.0.0,>=8.1.6->skimpy) (0.4.6)
Requirement already satisfied: jupyter-client>=6.1.12 in c:\users\acer\anaconda31\lib\site-packages (from ipykernel<7.0.0,>=6.7.0->skimpy) (7.3.4)
Requirement already satisfied: debugpy>=1.0 in c:\users\acer\anaconda31\lib\site-packages (from ipykernel<7.0.0,>=6.7.0->skimpy) (1.5.1)
Requirement already satisfied: psutil in c:\users\acer\anaconda31\lib\site-packages (from ipykernel<7.0.0,>=6.7.0->skimpy) (5.9.0)
Requirement already satisfied: traitlets>=5.4.0 in c:\users\acer\anaconda31\lib\site-packages (from ipykernel<7.0.0,>=6.7.0->skimpy) (5.7.1)
Requirement already satisfied: matplotlib-inline>=0.1 in c:\users\acer\anaconda31\lib\site-packages (from ipykernel<7.0.0,>=6.7.0->skimpy) (0.1.6)
Requirement already satisfied: packaging in c:\users\acer\anaconda31\lib\site-packages (from ipykernel<7.0.0,>=6.7.0->skimpy) (22.0)
Requirement already satisfied: comm>=0.1.1 in c:\users\acer\anaconda31\lib\site-packages (from ipykernel<7.0.0,>=6.7.0->skimpy) (0.1.2)
Requirement already satisfied: pyzmq>=17 in c:\users\acer\anaconda31\lib\site-packages (from ipykernel<7.0.0,>=6.7.0->skimpy) (23.2.0)
Requirement already satisfied: ipython>=7.23.1 in c:\users\acer\anaconda31\lib\site-packages (from ipykernel<7.0.0,>=6.7.0->skimpy) (8.10.0)
Requirement already satisfied: tornado>=6.1 in c:\users\acer\anaconda31\lib\site-packages (from ipykernel<7.0.0,>=6.7.0->skimpy) (6.1)
Requirement already satisfied: nest-asyncio in c:\users\acer\anaconda31\lib\site-packages (from ipykernel<7.0.0,>=6.7.0->skimpy) (1.5.6)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\acer\anaconda31\lib\site-packages (from pandas<3.0.0,>=2.0.3->skimpy) (2.8.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\acer\anaconda31\lib\site-packages (from pandas<3.0.0,>=2.0.3->skimpy) (2024.1)
Requirement already satisfied: pytz>=2020.1 in c:\users\acer\anaconda31\lib\site-packages (from pandas<3.0.0,>=2.0.3->skimpy) (2022.7)
Requirement already satisfied: importlib-resources>=5.10.2 in c:\users\acer\anaconda31\lib\site-packages (from quartodoc<0.8.0,>=0.7.2->skimpy) (6.3.2)
Requirement already satisfied: sphobjinv>=2.3.1 in c:\users\acer\anaconda31\lib\site-packages (from quartodoc<0.8.0,>=0.7.2->skimpy) (2.3.1)
Requirement already satisfied: importlib-metadata>=5.1.0 in c:\users\acer\anaconda31\lib\site-packages (from quartodoc<0.8.0,>=0.7.2->skimpy) (7.0.2)
Requirement already satisfied: pyyaml in c:\users\acer\anaconda31\lib\site-packages (from quartodoc<0.8.0,>=0.7.2->skimpy) (6.0)
Requirement already satisfied: watchdog>=3.0.0 in c:\users\acer\anaconda31\lib\site-packages (from quartodoc<0.8.0,>=0.7.2->skimpy) (4.0.0)
Requirement already satisfied: plum-dispatch>2.0.0 in c:\users\acer\anaconda31\lib\site-packages (from quartodoc<0.8.0,>=0.7.2->skimpy) (2.3.2)
Requirement already satisfied: pydantic in c:\users\acer\anaconda31\lib\site-packages (from quartodoc<0.8.0,>=0.7.2->skimpy) (1.10.8)
Requirement already satisfied: griffe>=0.33 in c:\users\acer\anaconda31\lib\site-packages (from quartodoc<0.8.0,>=0.7.2->skimpy) (0.42.1)
Requirement already satisfied: tabulate>=0.9.0 in c:\users\acer\anaconda31\lib\site-packages (from quartodoc<0.8.0,>=0.7.2->skimpy) (0.9.0)
Requirement already satisfied: commonmark<0.10.0,>=0.9.0 in c:\users\acer\anaconda31\lib\site-packages (from rich<14.0,>=10.9->skimpy) (0.9.1)
Requirement already satisfied: zipp>=0.5 in c:\users\acer\anaconda31\lib\site-packages (from importlib-metadata>=5.1.0->quartodoc<0.8.0,>=0.7.2->skimpy) (3.11.0)
Requirement already satisfied: stack-data in c:\users\acer\anaconda31\lib\site-packages (from ipython>=7.23.1->ipykernel<7.0.0,>=6.7.0->skimpy) (0.2.0)
Requirement already satisfied: decorator in c:\users\acer\anaconda31\lib\site-packages (from ipython>=7.23.1->ipykernel<7.0.0,>=6.7.0->skimpy) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\acer\anaconda31\lib\site-packages (from ipython>=7.23.1->ipykernel<7.0.0,>=6.7.0->skimpy) (0.18.1)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.30 in c:\users\acer\anaconda31\lib\site-packages (from ipython>=7.23.1->ipykernel<7.0.0,>=6.7.0->skimpy) (3.0.36)
Requirement already satisfied: backcall in c:\users\acer\anaconda31\lib\site-packages (from ipython>=7.23.1->ipykernel<7.0.0,>=6.7.0->skimpy) (0.2.0)
Requirement already satisfied: pickleshare in c:\users\acer\anaconda31\lib\site-packages (from ipython>=7.23.1->ipykernel<7.0.0,>=6.7.0->skimpy) (0.7.5)
Requirement already satisfied: entrypoints in c:\users\acer\anaconda31\lib\site-packages (from jupyter-client>=6.1.12->ipykernel<7.0.0,>=6.7.0->skimpy) (0.4)
Requirement already satisfied: jupyter-core>=4.9.2 in c:\users\acer\anaconda31\lib\site-packages (from jupyter-client>=6.1.12->ipykernel<7.0.0,>=6.7.0->skimpy) (5.2.0)
Requirement already satisfied: beartype>=0.16.2 in c:\users\acer\anaconda31\lib\site-packages (from plum-dispatch>2.0.0->quartodoc<0.8.0,>=0.7.2->skimpy) (0.17.2)
Requirement already satisfied: six>=1.5 in c:\users\acer\anaconda31\lib\site-packages (from python-dateutil>=2.8.2->pandas<3.0.0,>=2.0.3->skimpy) (1.16.0)
Requirement already satisfied: jsonschema>=3.0 in c:\users\acer\anaconda31\lib\site-packages (from sphobjinv>=2.3.1->quartodoc<0.8.0,>=0.7.2->skimpy) (4.17.3)
Requirement already satisfied: certifi in c:\users\acer\anaconda31\lib\site-packages (from sphobjinv>=2.3.1->quartodoc<0.8.0,>=0.7.2->skimpy) (2023.5.7)
Requirement already satisfied: attrs>=19.2 in c:\users\acer\anaconda31\lib\site-packages (from sphobjinv>=2.3.1->quartodoc<0.8.0,>=0.7.2->skimpy) (22.1.0)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\acer\anaconda31\lib\site-packages (from jedi>=0.16->ipython>=7.23.1->ipykernel<7.0.0,>=6.7.0->skimpy) (0.8.3)
Requirement already satisfied: pyrsistent!=0.17.0,!=0.17.1,!=0.17.2,>=0.14.0 in c:\users\acer\anaconda31\lib\site-packages (from jsonschema>=3.0->sphobjinv>=2.3.1->quartodoc<0.8.0,>=0.7.2->skimpy) (0.18.0)
Requirement already satisfied: platformdirs>=2.5 in c:\users\acer\anaconda31\lib\site-packages (from jupyter-core>=4.9.2->jupyter-client>=6.1.12->ipykernel<7.0.0,>=6.7.0->skimpy) (2.5.2)
Requirement already satisfied: pywin32>=1.0 in c:\users\acer\anaconda31\lib\site-packages (from jupyter-core>=4.9.2->jupyter-client>=6.1.12->ipykernel<7.0.0,>=6.7.0->skimpy) (305.1)
Requirement already satisfied: wcwidth in c:\users\acer\anaconda31\lib\site-packages (from prompt-toolkit<3.1.0,>=3.0.30->ipython>=7.23.1->ipykernel<7.0.0,>=6.7.0->skimpy) (0.2.5)
Requirement already satisfied: pure-eval in c:\users\acer\anaconda31\lib\site-packages (from stack-data->ipython>=7.23.1->ipykernel<7.0.0,>=6.7.0->skimpy) (0.2.2)
Requirement already satisfied: executing in c:\users\acer\anaconda31\lib\site-packages (from stack-data->ipython>=7.23.1->ipykernel<7.0.0,>=6.7.0->skimpy) (0.8.3)
Requirement already satisfied: asttokens in c:\users\acer\anaconda31\lib\site-packages (from stack-data->ipython>=7.23.1->ipykernel<7.0.0,>=6.7.0->skimpy) (2.0.5)
Installing collected packages: quartodoc, skimpy
Successfully installed quartodoc-0.7.2 skimpy-0.0.14
Note: you may need to restart the kernel to use updated packages.

WARNING: Ignoring invalid distribution -andas (c:\users\acer\anaconda31\lib\site-packages)
WARNING: Ignoring invalid distribution -andas (c:\users\acer\anaconda31\lib\site-packages)
WARNING: Ignoring invalid distribution -andas (c:\users\acer\anaconda31\lib\site-packages)
WARNING: Ignoring invalid distribution -andas (c:\users\acer\anaconda31\lib\site-packages)
WARNING: Ignoring invalid distribution -andas (c:\users\acer\anaconda31\lib\site-packages)
WARNING: Ignoring invalid distribution -andas (c:\users\acer\anaconda31\lib\site-packages)
WARNING: Ignoring invalid distribution -andas (c:\users\acer\anaconda31\lib\site-packages)
WARNING: Ignoring invalid distribution -andas (c:\users\acer\anaconda31\lib\site-packages)

In [26]:
# Trick

from skimpy import skim
skim(df)

╭──────────────────────────────────────────────── skimpy summary ─────────────────────────────────────────────────╮
│          Data Summary                Data Types                                                                 │
│ ┏━━━━━━━━━━━━━━━━━━━┳━━━━━━━━┓ ┏━━━━━━━━━━━━━┳━━━━━━━┓                                                          │
│ ┃ dataframe         ┃ Values ┃ ┃ Column Type ┃ Count ┃                                                          │
│ ┡━━━━━━━━━━━━━━━━━━━╇━━━━━━━━┩ ┡━━━━━━━━━━━━━╇━━━━━━━┩                                                          │
│ │ Number of rows    │ 5      │ │ string      │ 2     │                                                          │
│ │ Number of columns │ 4      │ │ int32       │ 2     │                                                          │
│ └───────────────────┴────────┘ └─────────────┴───────┘                                                          │
│                                                     number                                                      │
│ ┏━━━━━━━━━━━━━━━━┳━━━━━┳━━━━━━━━┳━━━━━━━━━┳━━━━━━━━━┳━━━━━━━━━┳━━━━━━━━━┳━━━━━━━━┳━━━━━━━━┳━━━━━━━━┳━━━━━━━━━┓  │
│ ┃ column_name    ┃ NA  ┃ NA %   ┃ mean    ┃ sd      ┃ p0      ┃ p25     ┃ p50    ┃ p75    ┃ p100   ┃ hist    ┃  │
│ ┡━━━━━━━━━━━━━━━━╇━━━━━╇━━━━━━━━╇━━━━━━━━━╇━━━━━━━━━╇━━━━━━━━━╇━━━━━━━━━╇━━━━━━━━╇━━━━━━━━╇━━━━━━━━╇━━━━━━━━━┩  │
│ │ Age            │   0 │      0 │      28 │     4.9 │      22 │      25 │     28 │     30 │     35 │ ▇▇▇▇ ▇  │  │
│ │ Salary         │   0 │      0 │   68000 │   10000 │   55000 │   60000 │  70000 │  75000 │  80000 │ ▇▇ ▇▇▇  │  │
│ └────────────────┴─────┴────────┴─────────┴─────────┴─────────┴─────────┴────────┴────────┴────────┴─────────┘  │
│                                                     string                                                      │
│ ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━┳━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━━━━━━━━━┓  │
│ ┃ column_name               ┃ NA      ┃ NA %       ┃ words per row                ┃ total words              ┃  │
│ ┡━━━━━━━━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━╇━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━━━━━━━━━━┩  │
│ │ Name                      │       0 │          0 │                            1 │                        5 │  │
│ │ City                      │       0 │          0 │                          1.6 │                        8 │  │
│ └───────────────────────────┴─────────┴────────────┴──────────────────────────────┴──────────────────────────┘  │
╰────────────────────────────────────────────────────── End ──────────────────────────────────────────────────────╯

In [28]:
pip install summarytools

Collecting summarytools
  Downloading summarytools-0.2.3.tar.gz (11 kB)
  Installing build dependencies: started
  Installing build dependencies: finished with status 'done'
  Getting requirements to build wheel: started
  Getting requirements to build wheel: finished with status 'done'
  Preparing metadata (pyproject.toml): started
  Preparing metadata (pyproject.toml): finished with status 'done'
Requirement already satisfied: pandas>=1.4.0 in c:\users\acer\anaconda31\lib\site-packages (from summarytools) (2.2.1)
Requirement already satisfied: ipython>=7.20.0 in c:\users\acer\anaconda31\lib\site-packages (from summarytools) (8.10.0)
Requirement already satisfied: numpy>=1.18.5 in c:\users\acer\anaconda31\lib\site-packages (from summarytools) (1.23.5)
Requirement already satisfied: matplotlib>=3.3.0 in c:\users\acer\anaconda31\lib\site-packages (from summarytools) (3.7.0)
Requirement already satisfied: pickleshare in c:\users\acer\anaconda31\lib\site-packages (from ipython>=7.20.0->summarytools) (0.7.5)
Requirement already satisfied: backcall in c:\users\acer\anaconda31\lib\site-packages (from ipython>=7.20.0->summarytools) (0.2.0)
Requirement already satisfied: colorama in c:\users\acer\anaconda31\lib\site-packages (from ipython>=7.20.0->summarytools) (0.4.6)
Requirement already satisfied: decorator in c:\users\acer\anaconda31\lib\site-packages (from ipython>=7.20.0->summarytools) (5.1.1)
Requirement already satisfied: pygments>=2.4.0 in c:\users\acer\anaconda31\lib\site-packages (from ipython>=7.20.0->summarytools) (2.11.2)
Requirement already satisfied: traitlets>=5 in c:\users\acer\anaconda31\lib\site-packages (from ipython>=7.20.0->summarytools) (5.7.1)
Requirement already satisfied: jedi>=0.16 in c:\users\acer\anaconda31\lib\site-packages (from ipython>=7.20.0->summarytools) (0.18.1)
Requirement already satisfied: matplotlib-inline in c:\users\acer\anaconda31\lib\site-packages (from ipython>=7.20.0->summarytools) (0.1.6)
Requirement already satisfied: stack-data in c:\users\acer\anaconda31\lib\site-packages (from ipython>=7.20.0->summarytools) (0.2.0)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.30 in c:\users\acer\anaconda31\lib\site-packages (from ipython>=7.20.0->summarytools) (3.0.36)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\acer\anaconda31\lib\site-packages (from matplotlib>=3.3.0->summarytools) (1.0.5)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\acer\anaconda31\lib\site-packages (from matplotlib>=3.3.0->summarytools) (3.0.9)
Requirement already satisfied: pillow>=6.2.0 in c:\users\acer\anaconda31\lib\site-packages (from matplotlib>=3.3.0->summarytools) (9.4.0)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\acer\anaconda31\lib\site-packages (from matplotlib>=3.3.0->summarytools) (2.8.2)
Requirement already satisfied: cycler>=0.10 in c:\users\acer\anaconda31\lib\site-packages (from matplotlib>=3.3.0->summarytools) (0.11.0)
Requirement already satisfied: packaging>=20.0 in c:\users\acer\anaconda31\lib\site-packages (from matplotlib>=3.3.0->summarytools) (22.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\acer\anaconda31\lib\site-packages (from matplotlib>=3.3.0->summarytools) (1.4.4)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\acer\anaconda31\lib\site-packages (from matplotlib>=3.3.0->summarytools) (4.25.0)
Requirement already satisfied: tzdata>=2022.7 in c:\users\acer\anaconda31\lib\site-packages (from pandas>=1.4.0->summarytools) (2024.1)
Requirement already satisfied: pytz>=2020.1 in c:\users\acer\anaconda31\lib\site-packages (from pandas>=1.4.0->summarytools) (2022.7)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\acer\anaconda31\lib\site-packages (from jedi>=0.16->ipython>=7.20.0->summarytools) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\acer\anaconda31\lib\site-packages (from prompt-toolkit<3.1.0,>=3.0.30->ipython>=7.20.0->summarytools) (0.2.5)
Requirement already satisfied: six>=1.5 in c:\users\acer\anaconda31\lib\site-packages (from python-dateutil>=2.7->matplotlib>=3.3.0->summarytools) (1.16.0)
Requirement already satisfied: pure-eval in c:\users\acer\anaconda31\lib\site-packages (from stack-data->ipython>=7.20.0->summarytools) (0.2.2)
Requirement already satisfied: asttokens in c:\users\acer\anaconda31\lib\site-packages (from stack-data->ipython>=7.20.0->summarytools) (2.0.5)
Requirement already satisfied: executing in c:\users\acer\anaconda31\lib\site-packages (from stack-data->ipython>=7.20.0->summarytools) (0.8.3)
Building wheels for collected packages: summarytools
  Building wheel for summarytools (pyproject.toml): started
  Building wheel for summarytools (pyproject.toml): finished with status 'done'
  Created wheel for summarytools: filename=summarytools-0.2.3-py3-none-any.whl size=8591 sha256=7f29c9481010d01e3c7f003880d52d59e199e49d5a49b471a273a39d0026efbb
  Stored in directory: c:\users\acer\appdata\local\pip\cache\wheels\ff\7b\6e\624b599b1395d48b1f8241ca2a8de2ac115e910a76a8e1c5e0
Successfully built summarytools
Installing collected packages: summarytools
Successfully installed summarytools-0.2.3
Note: you may need to restart the kernel to use updated packages.

WARNING: Ignoring invalid distribution -andas (c:\users\acer\anaconda31\lib\site-packages)
WARNING: Ignoring invalid distribution -andas (c:\users\acer\anaconda31\lib\site-packages)
WARNING: Ignoring invalid distribution -andas (c:\users\acer\anaconda31\lib\site-packages)
WARNING: Ignoring invalid distribution -andas (c:\users\acer\anaconda31\lib\site-packages)
WARNING: Ignoring invalid distribution -andas (c:\users\acer\anaconda31\lib\site-packages)
WARNING: Ignoring invalid distribution -andas (c:\users\acer\anaconda31\lib\site-packages)
WARNING: Ignoring invalid distribution -andas (c:\users\acer\anaconda31\lib\site-packages)

In [29]:
from summarytools import dfSummary

In [30]:
dfSummary(df)

In [31]:
df

      Name  Age           City  Salary
0    Alice   25       New York   60000
1      Bob   30  San Francisco   80000
2  Charlie   22    Los Angeles   55000
3    David   35        Chicago   75000
4      Eva   28          Miami   70000

In [39]:
# Filtering multiple columns with multiple city names
filter_data = df[df['City'].isin(['Los Angeles','New York','ABC'])]
filter_data

      Name  Age         City  Salary
0    Alice   25     New York   60000
2  Charlie   22  Los Angeles   55000

In [40]:
df.query('City == ("Los Angeles","Miami")')

      Name  Age         City  Salary
2  Charlie   22  Los Angeles   55000
4      Eva   28        Miami   70000

In [41]:
df.query('City in ("Los Angeles","Miami")')

      Name  Age         City  Salary
2  Charlie   22  Los Angeles   55000
4      Eva   28        Miami   70000

In [43]:
age_threshold = 29
df.query('Age > @age_threshold')

    Name  Age           City  Salary
1    Bob   30  San Francisco   80000
3  David   35        Chicago   75000

In [45]:
print(df[df['Age'] > df['Age'].median()])

    Name  Age           City  Salary
1    Bob   30  San Francisco   80000
3  David   35        Chicago   75000

In [50]:
# Filter the rows where the length of city is greater than 7

a = df[df['City'].apply(lambda x: len(x) > 7)]
a

      Name  Age           City  Salary
0    Alice   25       New York   60000
1      Bob   30  San Francisco   80000
2  Charlie   22    Los Angeles   55000

In [52]:
df.query('City.str.len()>7')

      Name  Age           City  Salary
0    Alice   25       New York   60000
1      Bob   30  San Francisco   80000
2  Charlie   22    Los Angeles   55000

In [53]:
df[df['City'].str.len()>7]

      Name  Age           City  Salary
0    Alice   25       New York   60000
1      Bob   30  San Francisco   80000
2  Charlie   22    Los Angeles   55000

In [90]:
# importing the module
import pandas as pd
# creating a sample dataframe
data = pd.DataFrame({'Brand': ['Maruti', 'Hyundai', 'Tata',
							'Mahindra', 'Maruti', 'Hyundai',
							'Renault', 'Tata', 'Maruti'],
					'Year': [2012, 2014, 2011, 2015, 2012,
							2016, 2014, 2018, 2019],
					'Kms Driven': [50000, 30000, 60000,
									25000, 10000, 46000,
									31000, 15000, 12000],
					'City': ['Gurgaon', 'Delhi', 'Mumbai',
							'Delhi', 'Mumbai', 'Delhi',
							'Mumbai', 'Chennai', 'Ghaziabad'],
					'Mileage': [28, 27, 25, 26, 28,
								29, 24, 21, 24]})
# displaying the DataFrame
display(data)

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [91]:
data

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [103]:
# Group by Function

# data.groupby('Brand')['kms Driven'].sum().reset_index()

d = data.groupby('Brand').sum('kms Driven').reset_index()
d

      Brand  Year  Kms Driven  Mileage
0   Hyundai  4030       76000       56
1  Mahindra  2015       25000       26
2    Maruti  6043       72000       80
3   Renault  2014       31000       24
4      Tata  4029       75000       46

In [104]:

import pandas as pd

 

# Sample DataFrame

data = {'product': ['A', 'B', 'A', 'B', 'A'],

        'category': ['X', 'Y', 'X', 'Y', 'X'],

        'price': [100, 150, 120, 200, 180],

        'quantity': [50, 30, 40, 20, 35]}

 

df = pd.DataFrame(data)

df

  product category  price  quantity
0       A        X    100        50
1       B        Y    150        30
2       A        X    120        40
3       B        Y    200        20
4       A        X    180        35

In [105]:
df

  product category  price  quantity
0       A        X    100        50
1       B        Y    150        30
2       A        X    120        40
3       B        Y    200        20
4       A        X    180        35

In [109]:
# Price by category
df.groupby('category')['price'].sum().reset_index()

  category  price
0        X    400
1        Y    350

In [117]:
# Count of product by Category

df.groupby('category')['product'].count().reset_index()

  category  product
0        X        3
1        Y        2

In [113]:
# Average Price of each category

df.groupby('category')['price'].mean().reset_index()

  category       price
0        X  133.333333
1        Y  175.000000

In [121]:
#import pandas as pd
# Sample DataFrame
#data = {'A': [1, 2, 3, 4, 5],
#        'B': ['a', 'b', 'c', 'd', 'e'],
#        'C': [10.5, 20.3, 15.8, 7.2, 18.6]}
#df = pd.DataFrame(data, index=['one', 'two', 'three', 'four', 'five'])
#df

In [122]:
# iLoc and loc

In [128]:
data1 = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie'],
                     'Age': [25, 30, 35]})

In [129]:
data1

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [130]:
data1.iloc[0]

Name    Alice
Age        25
Name: 0, dtype: object

In [136]:
data1.iloc[2,1]

35

In [138]:
data1.iloc[1,0]

'Bob'

In [140]:
da1 = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie'],
                     'Age': [25, 30, 35],
                     'City':['NY','SN','LA']})

In [141]:
da1

      Name  Age City
0    Alice   25   NY
1      Bob   30   SN
2  Charlie   35   LA

In [142]:
da1.iloc[1:]

      Name  Age City
1      Bob   30   SN
2  Charlie   35   LA

In [144]:
#loc
da1 = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie'],
                     'Age': [25, 30, 35],
                     'City':['NY','SN','LA']})

In [148]:
filtered_data = da1.loc[da1['Age'] > 30]
filtered_data

      Name  Age City
2  Charlie   35   LA

In [149]:
# importing the module
import pandas as pd
# creating a sample dataframe
data = pd.DataFrame({'Brand': ['Maruti', 'Hyundai', 'Tata',
							'Mahindra', 'Maruti', 'Hyundai',
							'Renault', 'Tata', 'Maruti'],
					'Year': [2012, 2014, 2011, 2015, 2012,
							2016, 2014, 2018, 2019],
					'Kms Driven': [50000, 30000, 60000,
									25000, 10000, 46000,
									31000, 15000, 12000],
					'City': ['Gurgaon', 'Delhi', 'Mumbai',
							'Delhi', 'Mumbai', 'Delhi',
							'Mumbai', 'Chennai', 'Ghaziabad'],
					'Mileage': [28, 27, 25, 26, 28,
								29, 24, 21, 24]})
# displaying the DataFrame
display(data)

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [152]:
data.loc[2:5]

      Brand  Year  Kms Driven    City  Mileage
2      Tata  2011       60000  Mumbai       25
3  Mahindra  2015       25000   Delhi       26
4    Maruti  2012       10000  Mumbai       28
5   Hyundai  2016       46000   Delhi       29

In [153]:
data.loc[2:5,'City']

2    Mumbai
3     Delhi
4    Mumbai
5     Delhi
Name: City, dtype: object

In [154]:
# Sample DataFrame
data = {'A': [1, 2, 3, 4, 5],
        'B': ['a', 'b', 'c', 'd', 'e'],
        'C': [10.5, 20.3, 15.8, 7.2, 18.6]}
df = pd.DataFrame(data, index=['one', 'two', 'three', 'four', 'five'])
df

       A  B     C
one    1  a  10.5
two    2  b  20.3
three  3  c  15.8
four   4  d   7.2
five   5  e  18.6

In [160]:
# Using loc to select a specific row and column
selected_value_loc = df.loc['three', 'B']
print(f"Using loc: {selected_value_loc}")
# Using iloc to select a specific row and column by numerical index
selected_value_iloc = df.iloc[2, 1]
print(f"Using iloc: {selected_value_iloc}")

Using loc: c
Using iloc: c

In [161]:
Customer = {
    'Name': ['Alice', 'Aob', 'Aharlie', 'David', 'Eva'],
    'Age': [25, 30, 22, 35, 28],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Miami'],
    'Salary': [60000, 80000, 55000, 75000, 70000]
}

In [162]:
Customer

{'Name': ['Alice', 'Aob', 'Aharlie', 'David', 'Eva'],
 'Age': [25, 30, 22, 35, 28],
 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Miami'],
 'Salary': [60000, 80000, 55000, 75000, 70000]}

In [163]:
df = pd.DataFrame(Customer)
df

      Name  Age           City  Salary
0    Alice   25       New York   60000
1      Aob   30  San Francisco   80000
2  Aharlie   22    Los Angeles   55000
3    David   35        Chicago   75000
4      Eva   28          Miami   70000

In [168]:
# Give me the new col. with Length = Cities
df['City'].apply(len)

0     8
1    13
2    11
3     7
4     5
Name: City, dtype: int64

In [177]:
# Give me the col. if salary is less than 5500 then Junior
df['Salary'].apply(lambda x: 'Junior' if x > 69000 else 'Senior')

0    Senior
1    Junior
2    Senior
3    Junior
4    Junior
Name: Salary, dtype: object

In [185]:
# Give the col. age is b/w 25 - 28 & salary 6000 - 7000 then 'M' else 'F'
df['Age'].apply(lambda x: 'M' if 25 <= x <= 28 else 'F')

0    M
1    F
2    F
3    F
4    M
Name: Age, dtype: object

In [190]:
df.apply(lambda x: 'M' if 25 <= x['Age'] <= 28 and 6000 <= x['Salary'] <= 7000 else 'F', axis=1)

0    F
1    F
2    F
3    F
4    F
dtype: object

In [191]:
df['CityLength'] = df['City'].str.len()

In [192]:
df

      Name  Age           City  Salary  CityLength
0    Alice   25       New York   60000           8
1      Aob   30  San Francisco   80000          13
2  Aharlie   22    Los Angeles   55000          11
3    David   35        Chicago   75000           7
4      Eva   28          Miami   70000           5